Revit 2024 API
PipingSystem.Remove Method
Overload List
Name | Description
Remove(ConnectorSet)
Removes connectors from system.
 (Inherited from MEPSystem.)
Remove(ICollection<ElementId>)
Remove elements from system.
 (Inherited from MEPSystem.)
See Also
PipingSystem Class
PipingSystem Members
Autodesk.Revit.DB.Plumbing Namespace